var mongoose = require('mongoose');

var booksSchema = mongoose.Schema({
    name: String,
    author: String,
    img: String,
    publishers: String,
    pages: String,
    ISBN: String,
    description: String,
    published: Date,
    genres: String
});

var Book = mongoose.model('Book', booksSchema);

module.exports.seedInitialBooks = function() {
    Book.find({}).exec(function(err, collection) {
        if (err) {
            console.log('Cannot find books: ' + err);
            return;
        }

        if (collection.length === 0) {
            Book.create({name: 'Науката около нас', author: 'Сюзън Мартиняу', img:'', publishers: 'Фют', pages: '88', ISBN: '9789546259936', description: 'В това образователно издание ще откриете специално подбрани експерименти, които децата може да извършат самостоятелно с подръчни материали. Книжката съдържа увлекателно поднесени обяснения на природни явления, които стават около нас ежедневно. Тя поднася забавни въпроси и тестове за осмисляне на информацията. В края ѝ ще намерите кратък речник с азбучен показалец и отговори на въпросите от тестовете.', published: new Date('2/14/2015'), genres: 'Детски'});
            Book.create({name: 'Спондж Боб Квадратни гащи - Спондж Боб се прави на клоун', author: 'Стивън Хилънбърг', img:'', publishers: 'Колибри', pages: '60', ISBN: '9786191505258', description: 'Спондж Боб се прави на клоун е сред най-увлекателните книжки за порестия герой. Възможно ли е ракбургерите на Спондж Боб да не са най-вкусните в Бикини Ботъм? (Ние не вярваме в това). А възможно ли е звездният готвач на Хрупкавият рак да стане клоун в цирка?Само почакайте и ще го видите с очите си!', published: new Date('1/2/2015'), genres: 'Детски'});
            Book.create({name: 'Малкият принц', author: 'Антоан дьо Сент-Екзюпери', img:'', publishers: 'Колибри', pages: '116', ISBN: '9786191505142', description: 'Малкият принц няма нужда от представяне. И не само защото всяка вечер в осем без десет българските деца от десетилетия заспиват с образа на първия Скай Уокър – момченцето със звездната мантия, а също, и главно, заради изключителната и повече от заслужена популярност на тази култова приказка. Както и защото с морала си, с поуките си и с философското си звучене тя е предназначена за възрастни толкова, колкото и за деца.', published: new Date('2/12/2015'), genres: 'Детски'});
            Book.create({name: 'Изкуството да рисуваш човешка фигура', author: 'Верена Земе', img:'', publishers: 'Книгомания', pages: '242', ISBN: '9786191950034', description: 'Кой не иска да се научи да рисува бързо, уверено и прекрасно? В това помагало ще намерите основните познания, необходими на начинаещи и напреднали, за да навлязат в света на изобразителното изкуство.След въведението са изложени най-важните аспекти в рисуването на човешки фигури на лесен и достъпен език. Ще намерите също и практични съвети, илюстрирани с рисунки. Изброени са необходимите материали за рисуване.', published: new Date('1/20/2015'), genres: 'Изкуство'});
            Book.create({name: 'Присъствия', author: 'Христо Стефанов', img:'', publishers: 'Захарий Стоянов', pages: '368', ISBN: '9789540907932', description: 'Христо Стефанов разговаря с Чавдар Попов за значимите присъствия в живота, изкуството, стенописа и за превратностите на съдбата.', published: new Date('1/25/2015'), genres: 'Изкуство'});
            Book.create({name: 'История на българите от Македония', author: 'Акад. Григор Велев', img:'', publishers: 'Военно издателство', pages: '432', ISBN: '9789545095276', description: 'Акад. проф. д-р Григор Велев е български учен и общественик. По професия е специалист по клинична патология. Бил е ректор на Висшия медицински институт в Стара Загора. Специализирал е в Москва и Париж. Публикувал е Ръководство за лекари патолози по Обща и Клинична патология и четири учебника за студенти по същата специалност. Съавтор е на четири ръководства за практически упражнения по патология.', published: new Date('1/12/2015'), genres: 'Исторически'});
            Book.create({name: 'Древните българи - първите европейци и цивилизатори', author: 'Владимир Цонев', img:'', publishers: 'Аркаим', pages: '192', ISBN: '9786199022429', description: 'В Древните българи - първи европейци и цивилизатори, като се опира на богат фактологичен материал и използва интердисциплинарния подход, авторът достига до изумителни разкрития. Цонев дава множество категорични отговори на въпроси.', published: new Date('1/10/2015'), tags: 'Исторически'});
        }
    });
};